# Напишите программу, которая принимает на вход координаты двух точек
# и находит расстояние между ними в 2D пространстве.
# Пример:
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21

import random
x_1 = random.randint(-10,10)
x_2 = random.randint(-10,10)
y_1 = random.randint(-10,10)
y_2 = random.randint(-10,10)
print(f'A ({x_1},{y_1}); B ({x_2},{y_2})')
distance = ((x_2-x_1)**2 + (y_2-y_1)**2)**(1/2)
print(f'Расстояние между точками = {round(distance,2)}')